; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-3 - location
	p0-5 - location
	p0-6 - location
	p1-2 - location
	p2-4 - location
	p3-1 - location
	p4-0 - location
	p4-5 - location
	p4-6 - location
	p6-5 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s5)
	(at driver4 s2)
	(at driver5 s0)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s6)
	(at package2 s0)
	(at package3 s5)
	(at package4 s5)
	(at package5 s2)
	(at package6 s3)
	(at package7 s3)
	(at package8 s5)
	(at package9 s1)
	(at package10 s2)
	(at package11 s5)
	(at package12 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 38)
	(= (time-to-drive s2 s0) 38)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 23)
	(= (time-to-drive s4 s0) 23)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 86)
	(= (time-to-drive s6 s2) 86)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 18)
	(= (time-to-drive s0 s3) 18)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 48)
	(= (time-to-drive s1 s4) 48)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 81)
	(= (time-to-drive s2 s4) 81)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 1)
	(= (time-to-drive s3 s4) 1)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 74)
	(= (time-to-drive s1 s5) 74)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 23)
	(= (time-to-drive s3 s5) 23)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 56)
	(= (time-to-drive s0 s6) 56)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 71)
	(= (time-to-drive s1 s6) 71)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 84)
	(= (time-to-drive s5 s6) 84)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s3)
	(at truck1 s3)
	(at truck3 s5)
	(at package2 s3)
	(at package3 s1)
	(at package4 s5)
	(at package5 s3)
	(at package6 s5)
	(at package7 s6)
	(at package8 s2)
	(at package9 s6)
	(at package10 s1)
	(at package11 s1)
	(at package12 s1)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver4 truck1 s2)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 14
2. (load-truck package5 truck1 s2)
   deleted: (at package5 s2)
   added: (in package5 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 14
3. (load-truck package10 truck1 s2)
   deleted: (at package10 s2)
   added: (in package10 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 14
4. (drive-truck truck1 s2 s6 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 0 to 1118
   goals met: 1 of 14
5. (walk driver1 s4 p2-4)
   deleted: (at driver1 s4)
   added: (at driver1 p2-4)
   goals met: 1 of 14
6. (drive-truck truck1 s6 s5 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 1118 to 2210
   goals met: 1 of 14
7. (load-truck package3 truck1 s5)
   deleted: (at package3 s5)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 1 of 14
8. (load-truck package8 truck1 s5)
   deleted: (at package8 s5)
   added: (in package8 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 1 of 14
9. (load-truck package11 truck1 s5)
   deleted: (at package11 s5)
   added: (in package11 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 1 of 14
10. (load-truck package12 truck1 s5)
   deleted: (at package12 s5)
   added: (in package12 truck1)
   changed: (load truck1) from 5 to 6, (fuel-per-minute truck1) from 25 to 31
   goals met: 1 of 14
11. (walk driver2 s4 p4-0)
   deleted: (at driver2 s4)
   added: (at driver2 p4-0)
   goals met: 1 of 14
12. (walk driver2 p4-0 s0)
   deleted: (at driver2 p4-0)
   added: (at driver2 s0)
   goals met: 1 of 14
13. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 1 of 14
14. (walk driver1 p2-4 s2)
   deleted: (at driver1 p2-4)
   added: (at driver1 s2)
   goals met: 1 of 14
15. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 2 of 14
16. (drive-truck truck1 s5 s3 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 2210 to 2923
   goals met: 3 of 14
17. (unload-truck package5 truck1 s3)
   deleted: (in package5 truck1)
   added: (at package5 s3)
   changed: (load truck1) from 6 to 5, (fuel-per-minute truck1) from 31 to 25
   goals met: 4 of 14
18. (load-truck package6 truck1 s3)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   changed: (load truck1) from 5 to 6, (fuel-per-minute truck1) from 25 to 31
   goals met: 4 of 14
19. (drive-truck truck1 s3 s5 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (fuel-used) from 2923 to 3636
   goals met: 3 of 14
20. (unload-truck package6 truck1 s5)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   changed: (load truck1) from 6 to 5, (fuel-per-minute truck1) from 31 to 25
   goals met: 4 of 14
21. (drive-truck truck1 s5 s3 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 3636 to 4211
   goals met: 5 of 14
22. (load-truck package7 truck1 s3)
   deleted: (at package7 s3)
   added: (in package7 truck1)
   changed: (load truck1) from 5 to 6, (fuel-per-minute truck1) from 25 to 31
   goals met: 5 of 14
23. (drive-truck truck1 s3 s0 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 4211 to 4769
   goals met: 4 of 14
24. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   changed: (load truck1) from 6 to 7, (fuel-per-minute truck1) from 31 to 38
   goals met: 4 of 14
25. (drive-truck truck1 s0 s6 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (fuel-used) from 4769 to 6897
   goals met: 4 of 14
26. (unload-truck package7 truck1 s6)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   changed: (load truck1) from 7 to 6, (fuel-per-minute truck1) from 38 to 31
   goals met: 5 of 14
27. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 5 of 14
28. (drive-truck truck1 s6 s1 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 6897 to 9098
   goals met: 5 of 14
29. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 6 to 5, (fuel-per-minute truck1) from 31 to 25
   goals met: 6 of 14
30. (unload-truck package10 truck1 s1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 7 of 14
31. (unload-truck package11 truck1 s1)
   deleted: (in package11 truck1)
   added: (at package11 s1)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 8 of 14
32. (unload-truck package12 truck1 s1)
   deleted: (in package12 truck1)
   added: (at package12 s1)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 9 of 14
33. (load-truck package9 truck1 s1)
   deleted: (at package9 s1)
   added: (in package9 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 9 of 14
34. (drive-truck truck1 s1 s6 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (fuel-used) from 9098 to 10234
   goals met: 9 of 14
35. (unload-truck package9 truck1 s6)
   deleted: (in package9 truck1)
   added: (at package9 s6)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 10 of 14
36. (drive-truck truck1 s6 s2 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (fuel-used) from 10234 to 11352
   goals met: 10 of 14
37. (unload-truck package8 truck1 s2)
   deleted: (in package8 truck1)
   added: (at package8 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 11 of 14
38. (drive-truck truck1 s2 s0 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 11352 to 11770
   goals met: 11 of 14
39. (drive-truck truck1 s0 s3 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 11770 to 11968
   goals met: 12 of 14
40. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 13 of 14
41. (drive-truck truck3 s2 s6 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 11968 to 12828
   goals met: 13 of 14
42. (drive-truck truck3 s6 s5 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 12828 to 13668
   goals met: 14 of 14
